# Helpful Pandas Tricks

Big thanks to https://towardsdatascience.com/pandas-tips-i-wish-i-knew-before-ef4ea6a39e1a for these amazing tricks!

In [2]:
import pandas as pd
import numpy as np
import random

## Explode

It unpacks the values in lists in a column and duplicates all other values, hence Explode!

In [7]:
df = pd.DataFrame()
df['list_col'] = [[random.randint(1, 10) for _ in range(random.randint(3, 5))] for _ in range(10)]
df.head()

            list_col
0    [5, 5, 6, 8, 9]
1  [9, 10, 4, 10, 6]
2         [10, 4, 2]
3   [3, 1, 9, 10, 7]
4     [5, 3, 10, 10]

In [8]:
df.explode('list_col').head(10)

  list_col
0        5
0        5
0        6
0        8
0        9
1        9
1       10
1        4
1       10
1        6

## Rolling Sum

In [9]:
df = pd.DataFrame()
df['some_col'] = list(range(10))
df.head()

   some_col
0         0
1         1
2         2
3         3
4         4

In [11]:
df['some_col'].rolling(2).sum()

0     NaN
1     1.0
2     3.0
3     5.0
4     7.0
5     9.0
6    11.0
7    13.0
8    15.0
9    17.0
Name: some_col, dtype: float64

## Pivot

A pivot table is a statistics table that summarizes the data of a more extensive table

In [14]:
df = pd.DataFrame()
df['fruit'] = ['orange', 'apple', 'mango', 'apple', 'watermelon']
df['name'] = ['yash', 'ben', 'alice', 'yash', 'bruce']
df['quantity'] = [1, 2, 3, 2, 2]

## A fruit shop with a few customers and their purchase quantities
df.head()

        fruit   name  quantity
0      orange   yash         1
1       apple    ben         2
2       mango  alice         3
3       apple   yash         2
4  watermelon  bruce         2

In [18]:
df.pivot_table(index='fruit', columns='name', values='quantity', aggfunc=np.sum)

name        alice  ben  bruce  yash
fruit
apple         NaN  2.0    NaN   2.0
mango         3.0  NaN    NaN   NaN
orange        NaN  NaN    NaN   1.0
watermelon    NaN  NaN    2.0   NaN